---
kind: type
id: T:Autodesk.Revit.UI.PulldownButtonData
source: html/854f1965-add4-a49e-f8fa-a51ac1c57abb.htm
---
# Autodesk.Revit.UI.PulldownButtonData

This class contains information necessary to construct a pulldown button in the Ribbon.

## Syntax (C#)
```csharp
public class PulldownButtonData : ButtonData
```